{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 1000, "word_counts": "{\"experience\": 73, \"wonderful\": 17, \"start\": 17, \"finish\": 17, \"package\": 14, \"arrived\": 14, \"today\": 14, \"thought\": 16, \"would\": 46, \"mediocre\": 16, \"turned\": 16, \"great\": 62, \"better\": 33, \"expected\": 43, \"indifferent\": 13, \"good\": 84, \"color\": 14, \"different\": 14, \"picture\": 14, \"terrible\": 80, \"looks\": 14, \"like\": 40, \"description\": 14, \"instructions\": 14, \"clear\": 14, \"enough\": 14, \"happy\": 17, \"nothing\": 26, \"special\": 26, \"pros\": 13, \"cons\": 13, \"love\": 17, \"strong\": 14, \"opinion\": 14, \"extremely\": 31, \"satisfied\": 17, \"results\": 17, \"worth\": 13, \"price\": 30, \"used\": 14, \"product\": 72, \"morning\": 14, \"okay\": 39, \"fantastic\": 16, \"work\": 14, \"advertised\": 14, \"hard\": 13, \"say\": 13, \"perfect\": 33, \"still\": 16, \"performs\": 14, \"everything\": 44, \"worked\": 17, \"flawlessly\": 17, \"absolutely\": 17, \"loved\": 17, \"works\": 33, \"incredibly\": 17, \"well\": 17, \"awesome\": 34, \"value\": 17, \"really\": 26, \"care\": 13, \"either\": 13, \"way\": 13, \"disappointing\": 13, \"hate\": 27, \"bad\": 81, \"actually\": 29, \"high\": 17, \"quality\": 61, \"service\": 31, \"might\": 13, \"use\": 13, \"sure\": 13, \"yet\": 13, \"made\": 34, \"day\": 31, \"much\": 17, \"doubted\": 16, \"first\": 16, \"amazing\": 33, \"exactly\": 17, \"needed\": 17, \"received\": 14, \"ordered\": 14, \"hoped\": 13, \"nice\": 13, \"sucked\": 13, \"neither\": 13, \"definitely\": 17, \"recommend\": 17, \"friends\": 17, \"poor\": 13, \"performance\": 13, \"worst\": 14, \"long\": 14, \"time\": 14, \"totally\": 13, \"worthless\": 13, \"potential\": 13, \"went\": 13, \"wrong\": 13, \"pretty\": 26, \"average\": 27, \"could\": 13, \"regret\": 14, \"buying\": 14, \"recommended\": 13, \"overall\": 26, \"broke\": 14, \"one\": 31, \"even\": 13, \"close\": 13, \"acceptable\": 26, \"parts\": 13, \"others\": 13, \"fine\": 13, \"guess\": 13, \"awful\": 40, \"support\": 14, \"serves\": 13, \"purpose\": 13, \"disappointed\": 14, \"started\": 13, \"quickly\": 13, \"became\": 13, \"complete\": 14, \"waste\": 14, \"money\": 14, \"neutral\": 13, \"can't\": 13, \"believe\": 13, \"best\": 17, \"purchases\": 17, \"tried\": 13}", "word_docs": "{\"wonderful\": 17, \"finish\": 17, \"start\": 17, \"experience\": 73, \"package\": 14, \"arrived\": 14, \"today\": 14, \"great\": 62, \"would\": 46, \"mediocre\": 16, \"turned\": 16, \"thought\": 16, \"expected\": 43, \"better\": 33, \"indifferent\": 13, \"good\": 84, \"picture\": 14, \"color\": 14, \"different\": 14, \"terrible\": 80, \"like\": 40, \"looks\": 14, \"description\": 14, \"clear\": 14, \"instructions\": 14, \"enough\": 14, \"happy\": 17, \"nothing\": 26, \"special\": 26, \"pros\": 13, \"cons\": 13, \"love\": 17, \"strong\": 14, \"opinion\": 14, \"satisfied\": 17, \"results\": 17, \"extremely\": 31, \"price\": 30, \"worth\": 13, \"product\": 72, \"used\": 14, \"morning\": 14, \"okay\": 39, \"fantastic\": 16, \"work\": 14, \"advertised\": 14, \"say\": 13, \"hard\": 13, \"still\": 16, \"perfect\": 33, \"performs\": 14, \"everything\": 44, \"worked\": 17, \"flawlessly\": 17, \"loved\": 17, \"incredibly\": 17, \"works\": 33, \"well\": 17, \"absolutely\": 17, \"value\": 17, \"awesome\": 34, \"way\": 13, \"really\": 26, \"either\": 13, \"care\": 13, \"disappointing\": 13, \"hate\": 27, \"actually\": 29, \"bad\": 81, \"high\": 17, \"service\": 31, \"quality\": 61, \"use\": 13, \"might\": 13, \"sure\": 13, \"yet\": 13, \"day\": 31, \"made\": 34, \"much\": 17, \"first\": 16, \"doubted\": 16, \"amazing\": 33, \"exactly\": 17, \"needed\": 17, \"ordered\": 14, \"received\": 14, \"hoped\": 13, \"nice\": 13, \"sucked\": 13, \"neither\": 13, \"recommend\": 17, \"definitely\": 17, \"friends\": 17, \"performance\": 13, \"poor\": 13, \"long\": 14, \"time\": 14, \"worst\": 14, \"worthless\": 13, \"totally\": 13, \"wrong\": 13, \"went\": 13, \"potential\": 13, \"average\": 27, \"pretty\": 26, \"could\": 13, \"buying\": 14, \"regret\": 14, \"recommended\": 13, \"overall\": 26, \"broke\": 14, \"one\": 31, \"acceptable\": 26, \"close\": 13, \"even\": 13, \"others\": 13, \"parts\": 13, \"guess\": 13, \"fine\": 13, \"awful\": 40, \"support\": 14, \"purpose\": 13, \"serves\": 13, \"disappointed\": 14, \"started\": 13, \"quickly\": 13, \"became\": 13, \"waste\": 14, \"complete\": 14, \"money\": 14, \"neutral\": 13, \"believe\": 13, \"can't\": 13, \"purchases\": 17, \"best\": 17, \"tried\": 13}", "index_docs": "{\"35\": 17, \"37\": 17, \"36\": 17, \"5\": 73, \"65\": 14, \"66\": 14, \"67\": 14, \"7\": 62, \"9\": 46, \"59\": 16, \"60\": 16, \"58\": 16, \"11\": 43, \"17\": 33, \"96\": 13, \"2\": 84, \"70\": 14, \"68\": 14, \"69\": 14, \"4\": 80, \"12\": 40, \"71\": 14, \"72\": 14, \"74\": 14, \"73\": 14, \"75\": 14, \"38\": 17, \"29\": 26, \"30\": 26, \"97\": 13, \"98\": 13, \"39\": 17, \"76\": 14, \"77\": 14, \"40\": 17, \"41\": 17, \"21\": 31, \"25\": 30, \"99\": 13, \"6\": 72, \"78\": 14, \"79\": 14, \"14\": 39, \"61\": 16, \"80\": 14, \"81\": 14, \"101\": 13, \"100\": 13, \"62\": 16, \"18\": 33, \"82\": 14, \"10\": 44, \"42\": 17, \"43\": 17, \"45\": 17, \"46\": 17, \"19\": 33, \"47\": 17, \"44\": 17, \"48\": 17, \"15\": 34, \"104\": 13, \"31\": 26, \"103\": 13, \"102\": 13, \"105\": 13, \"27\": 27, \"26\": 29, \"3\": 81, \"49\": 17, \"22\": 31, \"8\": 61, \"107\": 13, \"106\": 13, \"108\": 13, \"109\": 13, \"23\": 31, \"16\": 34, \"50\": 17, \"64\": 16, \"63\": 16, \"20\": 33, \"51\": 17, \"52\": 17, \"84\": 14, \"83\": 14, \"110\": 13, \"111\": 13, \"112\": 13, \"113\": 13, \"54\": 17, \"53\": 17, \"55\": 17, \"115\": 13, \"114\": 13, \"86\": 14, \"87\": 14, \"85\": 14, \"117\": 13, \"116\": 13, \"120\": 13, \"119\": 13, \"118\": 13, \"28\": 27, \"32\": 26, \"121\": 13, \"89\": 14, \"88\": 14, \"122\": 13, \"33\": 26, \"90\": 14, \"24\": 31, \"34\": 26, \"124\": 13, \"123\": 13, \"126\": 13, \"125\": 13, \"128\": 13, \"127\": 13, \"13\": 40, \"91\": 14, \"130\": 13, \"129\": 13, \"92\": 14, \"131\": 13, \"132\": 13, \"133\": 13, \"94\": 14, \"93\": 14, \"95\": 14, \"134\": 13, \"136\": 13, \"135\": 13, \"57\": 17, \"56\": 17, \"137\": 13}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"good\", \"3\": \"bad\", \"4\": \"terrible\", \"5\": \"experience\", \"6\": \"product\", \"7\": \"great\", \"8\": \"quality\", \"9\": \"would\", \"10\": \"everything\", \"11\": \"expected\", \"12\": \"like\", \"13\": \"awful\", \"14\": \"okay\", \"15\": \"awesome\", \"16\": \"made\", \"17\": \"better\", \"18\": \"perfect\", \"19\": \"works\", \"20\": \"amazing\", \"21\": \"extremely\", \"22\": \"service\", \"23\": \"day\", \"24\": \"one\", \"25\": \"price\", \"26\": \"actually\", \"27\": \"hate\", \"28\": \"average\", \"29\": \"nothing\", \"30\": \"special\", \"31\": \"really\", \"32\": \"pretty\", \"33\": \"overall\", \"34\": \"acceptable\", \"35\": \"wonderful\", \"36\": \"start\", \"37\": \"finish\", \"38\": \"happy\", \"39\": \"love\", \"40\": \"satisfied\", \"41\": \"results\", \"42\": \"worked\", \"43\": \"flawlessly\", \"44\": \"absolutely\", \"45\": \"loved\", \"46\": \"incredibly\", \"47\": \"well\", \"48\": \"value\", \"49\": \"high\", \"50\": \"much\", \"51\": \"exactly\", \"52\": \"needed\", \"53\": \"definitely\", \"54\": \"recommend\", \"55\": \"friends\", \"56\": \"best\", \"57\": \"purchases\", \"58\": \"thought\", \"59\": \"mediocre\", \"60\": \"turned\", \"61\": \"fantastic\", \"62\": \"still\", \"63\": \"doubted\", \"64\": \"first\", \"65\": \"package\", \"66\": \"arrived\", \"67\": \"today\", \"68\": \"color\", \"69\": \"different\", \"70\": \"picture\", \"71\": \"looks\", \"72\": \"description\", \"73\": \"instructions\", \"74\": \"clear\", \"75\": \"enough\", \"76\": \"strong\", \"77\": \"opinion\", \"78\": \"used\", \"79\": \"morning\", \"80\": \"work\", \"81\": \"advertised\", \"82\": \"performs\", \"83\": \"received\", \"84\": \"ordered\", \"85\": \"worst\", \"86\": \"long\", \"87\": \"time\", \"88\": \"regret\", \"89\": \"buying\", \"90\": \"broke\", \"91\": \"support\", \"92\": \"disappointed\", \"93\": \"complete\", \"94\": \"waste\", \"95\": \"money\", \"96\": \"indifferent\", \"97\": \"pros\", \"98\": \"cons\", \"99\": \"worth\", \"100\": \"hard\", \"101\": \"say\", \"102\": \"care\", \"103\": \"either\", \"104\": \"way\", \"105\": \"disappointing\", \"106\": \"might\", \"107\": \"use\", \"108\": \"sure\", \"109\": \"yet\", \"110\": \"hoped\", \"111\": \"nice\", \"112\": \"sucked\", \"113\": \"neither\", \"114\": \"poor\", \"115\": \"performance\", \"116\": \"totally\", \"117\": \"worthless\", \"118\": \"potential\", \"119\": \"went\", \"120\": \"wrong\", \"121\": \"could\", \"122\": \"recommended\", \"123\": \"even\", \"124\": \"close\", \"125\": \"parts\", \"126\": \"others\", \"127\": \"fine\", \"128\": \"guess\", \"129\": \"serves\", \"130\": \"purpose\", \"131\": \"started\", \"132\": \"quickly\", \"133\": \"became\", \"134\": \"neutral\", \"135\": \"can't\", \"136\": \"believe\", \"137\": \"tried\"}", "word_index": "{\"<UNK>\": 1, \"good\": 2, \"bad\": 3, \"terrible\": 4, \"experience\": 5, \"product\": 6, \"great\": 7, \"quality\": 8, \"would\": 9, \"everything\": 10, \"expected\": 11, \"like\": 12, \"awful\": 13, \"okay\": 14, \"awesome\": 15, \"made\": 16, \"better\": 17, \"perfect\": 18, \"works\": 19, \"amazing\": 20, \"extremely\": 21, \"service\": 22, \"day\": 23, \"one\": 24, \"price\": 25, \"actually\": 26, \"hate\": 27, \"average\": 28, \"nothing\": 29, \"special\": 30, \"really\": 31, \"pretty\": 32, \"overall\": 33, \"acceptable\": 34, \"wonderful\": 35, \"start\": 36, \"finish\": 37, \"happy\": 38, \"love\": 39, \"satisfied\": 40, \"results\": 41, \"worked\": 42, \"flawlessly\": 43, \"absolutely\": 44, \"loved\": 45, \"incredibly\": 46, \"well\": 47, \"value\": 48, \"high\": 49, \"much\": 50, \"exactly\": 51, \"needed\": 52, \"definitely\": 53, \"recommend\": 54, \"friends\": 55, \"best\": 56, \"purchases\": 57, \"thought\": 58, \"mediocre\": 59, \"turned\": 60, \"fantastic\": 61, \"still\": 62, \"doubted\": 63, \"first\": 64, \"package\": 65, \"arrived\": 66, \"today\": 67, \"color\": 68, \"different\": 69, \"picture\": 70, \"looks\": 71, \"description\": 72, \"instructions\": 73, \"clear\": 74, \"enough\": 75, \"strong\": 76, \"opinion\": 77, \"used\": 78, \"morning\": 79, \"work\": 80, \"advertised\": 81, \"performs\": 82, \"received\": 83, \"ordered\": 84, \"worst\": 85, \"long\": 86, \"time\": 87, \"regret\": 88, \"buying\": 89, \"broke\": 90, \"support\": 91, \"disappointed\": 92, \"complete\": 93, \"waste\": 94, \"money\": 95, \"indifferent\": 96, \"pros\": 97, \"cons\": 98, \"worth\": 99, \"hard\": 100, \"say\": 101, \"care\": 102, \"either\": 103, \"way\": 104, \"disappointing\": 105, \"might\": 106, \"use\": 107, \"sure\": 108, \"yet\": 109, \"hoped\": 110, \"nice\": 111, \"sucked\": 112, \"neither\": 113, \"poor\": 114, \"performance\": 115, \"totally\": 116, \"worthless\": 117, \"potential\": 118, \"went\": 119, \"wrong\": 120, \"could\": 121, \"recommended\": 122, \"even\": 123, \"close\": 124, \"parts\": 125, \"others\": 126, \"fine\": 127, \"guess\": 128, \"serves\": 129, \"purpose\": 130, \"started\": 131, \"quickly\": 132, \"became\": 133, \"neutral\": 134, \"can't\": 135, \"believe\": 136, \"tried\": 137}"}}